'''
    صورت سوال از ما میخواهد یک عدد اینتجر را بگیرد و تبدیل کنیم به عدد رومن 

'''

def intToRoman(num):
    '''
        روش حل : ما اول باید یک دیکشنری بسازیم که تمام حالت های حروف رومن توش باشه 
        چون میخواهیم عدد اینتیجر ما به رومن تبدیل بشه کلید های دیکشنری رااعداد قرار میدهیم 
        بخاطر این که حلقه ما سریع عمل کند اول باید حتما با ترتیب بنویسم در داخل دیکشنری این کار باعث میشود برنامههه بهینه تر باشه 
        حالا عددی که به ما میدهند از بزرگ به کوچک تقسیم میکنیم 
        مثلا : 
        ۴۲۱ / 400 = ۲۱
        ۲۱ / 10 = ۲ 
        ۲ == 'I''I'
        حاصل جواب = 'CDXII'
        
        اضافه میکنیم  result هر سری که تقسیم میکنیم ما نماد را به 
    '''
    
    
    # دیکشنری برای نگاشت اعداد به نمادهای رومی
    Symbol = {
        1000: 'M', 900: 'CM', 500: 'D', 400: 'CD', 100: 'C', 90: 'XC',
        50: 'L', 40: 'XL', 10: 'X', 9: 'IX', 5: 'V', 4: 'IV', 1: 'I'
    }
    
    result = ''
    for k, v in Symbol.items(): #  .items() هر بار هم کلید را داریم و هم ولیو را 
        c = num // k
        if c: # باقیمانده
            result += (v * c)
            num %= k
            if num == 0:
                break
    return result    