def intToRoman(num):
    # دیکشنری برای نگاشت اعداد به نمادهای رومی
    Symbol = {
        1000: 'M', 900: 'CM', 500: 'D', 400: 'CD', 100: 'C', 90: 'XC',
        50: 'L', 40: 'XL', 10: 'X', 9: 'IX', 5: 'V', 4: 'IV', 1: 'I'
    }
    
    # متغیر برای ذخیره نتیجه نهایی
    result = ''
    
    # حلقه برای تبدیل عدد به نماد رومی
    for k, v in Symbol.items():
        # تعداد دفعاتی که عدد k در num قرار می‌گیرد
        c = num // k
        if c:
            # اضافه کردن نماد رومی به نتیجه
            result += (v * c)
            # به‌روزرسانی num با باقی‌مانده
            num %= k
            # اگر num صفر شود، حلقه را می‌شکنیم
            if num == 0:
                break
    
    # برگرداندن نتیجه نهایی
    return result    