'''
    یک تابع میخواهد که لیست از ورودی میگیرد که جمع ۳ تا عدد مجموع آنها صفر باشد 
    ممکن است بیشتر از ۳ تا عدد باشه که جمع آنها صفر باشه یعنی ممکن است ۳ تا عدد دیگر هم باشد 
    در این صورت ما تمام آنها را نمایش میدهیم و باید تکراری هم نباشد
    
'''

def threeSum(nums):
    
    '''
        روش حل : اولین کار ما عدد ها رو مرتب میکنیم 
        که به اولین عدد ما اشاره میکند به آخر لیست برسد i به ۳ تا پوینتر نیاز دارم و      
        به اسم چپ و دیگری انتهای لیست را نمایش میدهد که میشود راست  i ت۲ تا پوینتر دیگر ما یکی از عدد بعد    
        به انتها برسد ولی چون ما ۲ تا نشانه گر داریم به همین دلیل ۲ تا مونده به اخر تموم میکنیم  i تا زمانی برنامه ما تمام میشود که 
        نکته جواب اگر مجموع اعداد کمتر از صفر بود پوینتر سمت چپ حرکت میکند 
        اگر بزرگ بود پوینتر سمت راست حرکت میکند 
        چرا : چون ما اعداد رو مرتب کردیم 
    
    '''
    
    # مرتب‌سازی لیست
    nums.sort()
    length = len(nums)
    out = []

    for i in range(length - 2):
        if i > 0 and nums[i] == nums[i - 1]:  # جلوگیری از تکرار اعداد
            continue
        left, right = i + 1, length - 1

        while left < right:
            current = nums[i] + nums[left] + nums[right]
            
            if current == 0: # اگر مجموع صفر باشد، ترکیب را ذخیره می‌کنیم
                out.append([nums[i], nums[left], nums[right]])
   
                """
                    شاید خانه ی بعد چپ و راست با هم برابر باشند 
                    مثلا ۳ تا ۲ پشت سر هم باش ند 
                    پس باید ۲ تا حلقه بنویسم که تا زمانی که برابر هستند بره عدد بعدی را چک کند تا زمانی که برابر نباشند
                 """
                while left < right and nums[left] == nums[left + 1]:
                    left += 1
                while left < right and nums[right] == nums[right - 1]:
                    right -= 1
                left += 1
                right -= 1
            
            elif current < 0: # اگر مجموع کمتر از صفر باشد، اشاره‌گر چپ را افزایش می‌دهیم
                left += 1
            else:  # اگر مجموع بیشتر از صفر باشد، اشاره‌گر راست را کاهش می‌دهیم
                right -= 1
                
    return out