'''
    به ما یک اعداد میدهد و ما  باید عدد رو برعکس کنیم و برگردانیم 
    نکته ی سوال این بخش است که ار ما عدد  انتیجر ۳۲ بیت میخواهد 
    
'''

def reverse(x):
    
    '''
        روش حل : نکته اول توی روش الگوریتم نباید استرینگ کنیم و برگردانیم 
        نکته دوم میگوید که احتمالا اعداد منقی هم باید باشه
        برای همین ما اول میبنیم که علامت چی هستش علامت را ذخیره میکنیم
        سپس شروع میکنیم عدد را تقسیم بر ۱۰ میکنیم تا زمانی که دیگه تقسیم تمام شد
        باقیمانده هر تقسیم را ضرب در ۱۰ میکنیم و با هم دیگه در نهایت جمع میکنیم   
    ''' 
    
    # تعیین علامت 
    sign, x = (1, x) if x >= 0 else (-1, -x)
    result = 0
    
    while x > 0:

        result = (result * 10) + (x % 10)
        x //= 10
    result *= sign
    
    # بررسی محدوده مجاز برای عدد معکوس شده
    if result < -2**31 or result > 2**31 - 1:
        return 0
    else:
        return result     
    
x = reverse(1534236469)
print (x)    


def reverse_python(x):
        result = 0 
        if x < 0: 
            result = int(str(x)[1:][::-1])*-1
        else:
            result = int(str(x)[::-1])
        if result > 2 ** 31 -1 or result < -2 ** 31:
            return 0
        else: 
            return result          


