
def isValid(s):
   
    _dict = {"(": ")", "[": "]", "{": "}"}
    stack = [] # از استک استفاده میکنیم 
    
    
    for i in s:
        # اگر کاراکتر یک پرانتز باز باشد، آن را به استک اضافه می‌کنیم
        if i in _dict:
            stack.append(i)
        #  آی را مقایسه میکند ولیوو آخرین آیتم داخل استک 
        #  len(stack)  اگر استریگ ما فقط یک یا هیچ آیتمی نداشته باشه ")"
        
        elif len(stack) and i != _dict[stack[-1]]:
            return False
        # اگر آی با ولیوو اخرین آیتم استک یکی باشد آنگاه درست است و از داخل استک پاک میشود و آی ما به جلو حرکت نمیکند
        else:
            stack.pop()
    
    # اگر استک خالی نباشد، رشته معتبر نیست
    if len(stack):
        return False
    return True
                 