'''  
    Substring : یعنی زیر مجموعه استریگ 
    مثلا : 'abcd' ==> abcd / abc bcd / ab / bc /cd / a /b /c /d
    سوال میگوید زیر رشته ای که بیشترین طول را دارد و حروف تکرار ندارد     

'''

def lengthOfLongestSubstring(s: str) -> int:
    
    '''  
        روش حل : از ست استفاده میکنیم چون متود اضافه کردن و پاک کردن دارد و دیکشنری است   
        دو تا نشانه گر میگذاریم در اولین خانه
        نمایش میدهد آیا در داخل ست وجود دارد ؟؟ اگر نه آن را اضافه میکنیم  j خانه ای که 
        if i - j + 1 > max ( agar bood ) i - j + 1 = max 
        بعلاوه یک میشود چون ایندکس از صفر شروع شروع میشود 
        را جلو میبریم  i در داخل ست باشد آن حروف رو از ست پاک میکنیم و  j حال اگر 
        به آخر برسد  j تا زمانی که 
        
    '''
    _set = set()
    i = j = 0
    length, _max = (0, 0) if len(s) == 0 else (len(s), 0) # اگر به ما یک استرینگ تو خالی بدهند 
    while j < length:
        " تا زمانی که به آخر برسد "
        if s[j] not in _set:
            _set.add(s[j])
            
            '''  _max  برای پیدا کردن و مقایسه بیشترین طول  '''            
            if _max <= j - i:
                _max = j - i + 1
                
            j += 1
        else:
            _set.remove(s[i])
            i += 1
            
    return _max